# schema.py

# 定义图谱的实体结构
# query_key: 用户自然语言搜名字时，对应的数据库属性名
# id_key: 用户搜ID时，对应的数据库属性名
GRAPH_SCHEMA = {
    "核查人": {
        "desc": "负责执行现场核查任务的工作人员",
        "id_key": "姓名", 
        "properties": ["单位"]
    },
    "防御区": {
        "desc": "重点防御的地质灾害区域",
        "id_key": "id",
        "properties": ["面积", "地理位置", "易发程度", "核查描述", "风险等级", "建议等级代码"]
    },
    "承灾体": {
        "desc": "可能受到灾害影响的对象（如房屋、学校）",
        "id_key": "id",
        "properties": ["面积", "地理位置", "威胁人口", "威胁财产", "建筑结构", "防御区位置"]
    },
    "核查单位": {
        "desc": "核查单位",
        "id_key": "单位名称",
        "properties": ["单位名称"]
    }
}

# 关系定义
RELATIONSHIPS = [
    "隶属 (核查人 -> 核查单位)",
    "核查 (核查人 -> 防御区)",
    "防御区承灾体关系 (防御区 -> 承灾体)"
]